Repository: Leonamin/python_utils
Catalog: json_key_copy/intl_*.arb
Languages: ar, es, fr, ja

# navRecord
source: Record
ar: سجل
es: Registro
fr: Enregistrement
ja: 記録

# navCalendar
source: Calendar
ar: التقويم
es: Calendario
fr: Calendrier
ja: カレンダー

# navStatistics
source: Statistics
ar: الإحصاءات
es: Estadísticas
fr: Statistiques
ja: 統計

# navSettings
source: Settings
ar: الإعدادات
es: Configuración
fr: Paramètres
ja: 設定

# labelDialogCancel
source: Cancel
ar: إلغاء
es: Cancelar
fr: Annuler
ja: キャンセル

# labelDialogClose
source: Close
ar: إغلاق
es: Cerrar
fr: Fermer
ja: 閉じる

# labelDialogConfirm
source: Confirm
ar: تأكيد
es: Confirmar
fr: Confirmer
ja: 確定

# titleDialogNetworkError
source: Network Error
ar: خطأ في الشبكة
es: Error de red
fr: Erreur réseau
ja: ネットワークエラー

# contentDialogNetworkError
source: Failed to connect to the server. Please check your network connection and try again.
ar: فشل في الاتصال بالخادم. يرجى التحقق من اتصالك بالشبكة والمحاولة مرة أخرى.
es: No se pudo conectar con el servidor. Por favor, revise su conexión de red e intente nuevamente.
fr: Impossible de se connecter au serveur. Veuillez vérifier votre connexion réseau et réessayer.
ja: サーバーに接続できませんでした。ネットワーク接続を確認して再試行してください。

# buttonNetworkRetry
source: Retry
ar: إعادة المحاولة
es: Reintentar
fr: Réessayer
ja: 再試行

# titleWeightDialogInput
source: Enter Weight
ar: تحديد الوزن
es: Introducir peso
fr: Saisir le poids
ja: 体重設定

# labelTextAreaHint
source: Enter here
ar: أدخل هنا
es: Ingrese aquí
fr: Entrez ici
ja: ここに入力

# labelTextAreaInput
source: Input
ar: إدخال
es: Entrada
fr: Saisir
ja: 入力

# labelRecordNoteHint
source: Note
ar: ملاحظة
es: Nota
ja: メモ

# buttonRecordSaveWeight
source: Save
ar: حفظ
es: Guardar
fr: Enregistrer
ja: 保存

# buttonRecordRegistHeight
source: Register Height
ar: تسجيل الطول
es: Registrar altura
fr: Enregistrer la taille
ja: 身長設定

# toastMessageRecordFailedToLoadWeights
source: Failed to load weight record
ar: فشل في تحميل سجل الوزن
es: Error al cargar los datos de peso
fr: Échec du chargement des données de poids
ja: 体重の読み込みに失敗しました

# toastMessageRecordFailedToRegistWeight
source: Failed to register weight record
ar: فشل في تسجيل الوزن
es: Error al registrar el peso
fr: Échec de l'inscription du poids
ja: 体重の記録に失敗しました

# toastMessageRecordFailedToEditWeight
source: Failed to edit weight record
ar: فشل في تعديل سجل الوزن
es: Error al editar el peso
fr: Échec de la modification du poids
ja: 体重の編集に失敗しました

# toastMessageRecordSuccessToRegistWeight
source: Successfully registered weight record
ar: تم تسجيل الوزن بنجاح
es: Peso registrado
fr: Poids enregistré
ja: 体重を記録しました

# toastMessageRecordSuccessToSaveRecord
source: Weight record saved successfully
ar: تم حفظ سجل الوزن بنجاح
es: Registro de peso guardado
fr: Données de poids sauvegardées
ja: 体重記録を保存しました

# toastMessageRecordFailedToSaveRecord
source: Failed to save weight record
ar: فشل في حفظ سجل الوزن
es: Error al guardar el registro de peso
fr: Échec de la sauvegarde des données de poids
ja: 体重記録の保存に失敗しました

# toastMessageRecordSuccessToDeleteRecord
source: Weight record deleted successfully
ar: تم حذف سجل الوزن بنجاح
es: Registro de peso eliminado
fr: Données de poids supprimées
ja: 体重記録を削除しました

# toastMessageRecordFailedToDeleteRecord
source: Failed to delete weight record
ar: فشل في حذف سجل الوزن
es: Error al eliminar el registro de peso
fr: Échec de la suppression des données de poids
ja: 体重記録の削除に失敗しました

# toastMessageRecordEnterCorrectFormat
source: Please enter in the correct format
ar: يرجى إدخال التنسيق الصحيح
es: Ingrese el formato correcto
fr: Veuillez entrer le format correct
ja: 正しい形式で入力してください

# toastMessageRecordSuccessToSaveAttachment
source: Note saved successfully
ar: تم حفظ الملاحظة بنجاح
es: Nota guardada
fr: Note enregistrée
ja: メモを保存しました

# toastMessageRecordFailedToSaveAttachment
source: Failed to save note
ar: فشل في حفظ الملاحظة
es: Error al guardar la nota
fr: Échec de l'enregistrement de la note
ja: メモの保存に失敗しました

# toastMessageRecordSuccessToDeleteAttachment
source: Note deleted successfully
ar: تم حذف الملاحظة بنجاح
es: Nota eliminada
fr: Note supprimée
ja: メモを削除しました

# toastMessageRecordFailedToDeleteAttachment
source: Failed to delete note
ar: فشل في حذف الملاحظة
es: Error al eliminar la nota
fr: Échec de la suppression de la note
ja: メモの削除に失敗しました

# buttonCalendarHeaderToday
source: Today
ar: اليوم
es: Hoy
fr: Aujourd'hui
ja: 今日

# contentStatisticsSincePrevious
source: Compared to last
ar: منذ التسجيل الأخير
es: Comparado con el anterior
fr: Comparé au dernier
ja: 前回の記録と比較して

# contentStatisticsSinceFirst
source: Since the beginning
ar: منذ التسجيل الأول
es: Comparado con el inicial
fr: Comparé au début
ja: 初回記録と比較して

# labelStatisticsWeightDiff
source: Weight Difference
ar: اختلاف الوزن
es: Diferencia de peso
fr: Différence de poids
ja: 体重変化

# labelTabStatisticsDaily
source: Daily
ar: يومي
es: Diario
fr: Quotidien
ja: 日次

# labelTabStatisticsWeekly
source: Weekly
ar: أسبوعي
es: Semanal
fr: Hebdomadaire
ja: 週次

# labelTabStatisticsMonthly
source: Monthly
ar: شهري
es: Mensual
fr: Mensuel
ja: 月次

# labelSettingHeight
source: Enter Height
ar: تحديد الطول
es: Introducir altura
fr: Saisir la taille
ja: 身長設定

# labelSettingResetData
source: Reset Data
ar: إعادة تعيين جميع البيانات
es: Restablecer los datos
fr: Réinitialiser les données
ja: データをリセット

# headerSettingHeightDialog
source: Enter Height
ar: تحديد الطول
es: Introducir altura
fr: Saisir la taille
ja: 身長設定

# headerSettingResetDataDialog
source: Reset
ar: إعادة تعيين
es: Restablecer
fr: Réinitialiser
ja: リセット

# contentResetDataDialog
source: Do you want to delete all records?
ar: هل تريد حقًا حذف جميع السجلات؟
es: ¿Desea eliminar todos los registros?
fr: Voulez-vous vraiment supprimer tous les enregistrements ?
ja: 本当にすべてのデータを削除しますか？

# labelResetDataDialogReset
source: Delete
ar: حذف
es: Eliminar
fr: Supprimer
ja: 削除

# toastMessageSettingFailedToLoadHeight
source: Failed to load height
ar: فشل في تحميل الطول
es: Error al cargar la altura
fr: Échec du chargement de la taille
ja: 身長の読み込みに失敗しました

# toastMessageSettingSuccessToSetHeight
source: Height registered successfully
ar: تم تسجيل الطول بنجاح
es: Altura registrada
fr: Taille enregistrée
ja: 身長を設定しました

# toastMessageSettingFailedToSetHeight
source: Failed to register height
ar: فشل في تسجيل الطول
es: Error al registrar la altura
fr: Échec de l'enregistrement de la taille
ja: 身長の設定に失敗しました

# toastMessageSettingFailedToEditHeight
source: Failed to edit height
ar: فشل في تعديل الطول
es: Error al editar la altura
fr: Échec de la modification de la taille
ja: 身長の編集に失敗しました

# toastMessageSettingSuccessToEditHeight
source: Height updated successfully
ar: تم تعديل الطول بنجاح
es: Altura editada
fr: Taille modifiée
ja: 身長を編集しました

# toastMessageSettingSuccessToResetData
source: Data reset successfully
ar: تم إعادة تعيين البيانات بنجاح
es: Datos restablecidos
fr: Données réinitialisées
ja: データをリセットしました

# toastMessageSettingFailedToResetData
source: Failed to reset data
ar: فشل في إعادة تعيين البيانات
es: Error al restablecer los datos
fr: Échec de la réinitialisation des données
ja: データのリセットに失敗しました

# toastMessageExitApp
source: Press back again to exit
ar: اضغط مرة أخرى للخروج
es: Presione de nuevo para salir
fr: Appuyez à nouveau pour quitter
ja: もう一度押すとアプリを終了します

# toastMessageGoBack
source: Press again to go back
ar: اضغط مرة أخرى للعودة.
es: Presiona una vez más para regresar.
fr: Appuyez encore une fois pour revenir en arrière.
ja: もう一度押すと戻ります。

# toastMessageFailedToLoadWeights
source: Failed to load weights
ar: فشل في تحميل الأوزان
es: Error al cargar los pesos
fr: Échec du chargement des poids
ja: 体重の読み込みに失敗しました

# labelSettingLab
source: Lab
ar: المختبر
es: Laboratorio
fr: Laboratoire
ja: ラボ

# labelTitleLab
source: Lab
ar: المختبر
es: Laboratorio
fr: Laboratoire
ja: ラボ

# labelLabAllowAd
source: Allow Ads
ar: السماح بالإعلانات
es: Permitir anuncios
fr: Autoriser les annonces
ja: 広告を許可

# bmiMyBMI
source: My BMI
ar: مؤشر كتلة الجسم الخاص بي
es: Mi IMC
fr: Mon IMC
ja: 私のBMI

source: BMI Classification
ar: تصنيف مؤشر كتلة الجسم
es: Clasificación de IMC
fr: Classification IMC
ja: BMI計算基準

# bmiLessThan
source: Less than {value}
ar: أقل من {value}
es: Menos de {value}
fr: Moins de {value}
ja: {value}未満

# bmiAbove
source: {value} and above
ar: {value} أو أكثر
es: {value} o más
fr: {value} ou plus
ja: {value}以上

# bmiUnderweight
source: Underweight
ar: نقص الوزن
es: Bajo peso
fr: Insuffisance pondérale
ja: 低体重

# bmiNormal
source: Normal weight
ar: وزن طبيعي
es: Peso normal
fr: Poids normal
ja: 正常体重

# bmiPreobesity
source: Pre-obesity
ar: ما قبل السمنة
es: Preobesidad
fr: Surpoids
ja: 前肥満

# bmiObesityClass1
source: Obesity class 1
ar: السمنة من الفئة 1
es: Obesidad clase 1
fr: Obésité classe 1
ja: 肥満1度

# bmiObesityClass2
source: Obesity class 2
ar: السمنة من الفئة 2
es: Obesidad clase 2
fr: Obésité classe 2
ja: 肥満2度

# bmiObesityClass3
source: Obesity class 3
ar: السمنة من الفئة 3
es: Obesidad clase 3
fr: Obésité classe 3
ja: 肥満3度

# contentRecordWeightDiff
source: {diffType, select, increased {{weightDiff}{unit} more than yesterday} decreased {{weightDiff}{unit} less than yesterday} other {same as yesterday}}
ar: {diffType, select, increased {{weightDiff}{unit} أكثر من أمس} decreased {{weightDiff}{unit} أقل من أمس} other {مطابق لأمس}}
es: {diffType, select, increased {{weightDiff}{unit} más que ayer} decreased {{weightDiff}{unit} menos que ayer} other {igual que ayer}}
fr: {diffType, select, increased {{weightDiff}{unit} de plus qu'hier} decreased {{weightDiff}{unit} de moins qu'hier} other {identique à hier}}
ja: {diffType, select, increased {昨日より+{weightDiff}{unit}} decreased {昨日より-{weightDiff}{unit}} other {昨日と同じ}}

# toastMessageValidWeightRange
source: Range: {from}{unit} to {to}{unit}
ar: النطاق المسموح به: {from}{unit} - {to}{unit}
es: Rango válido: de {from}{unit} a {to}{unit}
fr: Plage valide : {from}{unit} à {to}{unit}
ja: 設定可能範囲: {from}{unit} - {to}{unit}

# toastMessageMinHeight
source: Minimum height: {height}
ar: يجب أن يكون الطول على الأقل {height}
es: La altura debe ser al menos {height}
fr: La taille doit être d'au moins {height}
ja: 身長は{height}以上でなければなりません

# toastMessageMaxHeight
source: Maximum height: {height}
ar: يجب أن يكون الطول على الأكثر {height}
es: La altura debe ser como máximo {height}
fr: La taille doit être d'au plus {height}
ja: 身長は{height}以下でなければなりません

# toastMessageCantOpenLink
source: Unable to open the link.
ar: لا يمكن فتح الرابط.
es: No se puede abrir el enlace.
fr: Impossible d'ouvrir le lien.
ja: リンクを開くことができません。

# labelSettingDonation
source: Donation
ar: الدعم
es: Donación
fr: Don
ja: 寄付

# titleDonation
source: Donate
ar: ادعمنا
es: Donar
fr: Faire un don
ja: 寄付する

# titleDonatorList
source: Our Donors
ar: الداعمين للتطبيق
es: Nuestros Donantes
fr: Nos Donateurs
ja: 寄付者の皆様

# labelDialogWrite
source: Write
ar: كتابة
es: Escribir
fr: Écrire
ja: 作成

# titleDonationAfterDonated
source: Write a Message
ar: اترك رسالة
es: Dejar un Mensaje
fr: Laisser un Message
ja: メッセージを作成

# contentDonationAfterDonated
source: Thank you for your support! Would you like to write a message?
ar: شكرًا لدعمك! هل تود ترك رسالة؟
es: ¡Gracias por tu donación! ¿Quieres dejar un mensaje?
fr: Merci pour votre don ! Souhaitez-vous laisser un message ?
ja: 寄付ありがとうございます！メッセージを作成しますか？

# labelDonationWriteEmptyName
source: Please enter your name.
ar: يرجى إدخال اسمك.
es: Por favor, introduce tu nombre.
fr: Veuillez entrer votre nom.
ja: 名前を入力してください。

# labelDonationWriteInvalidEmail
source: Invalid email address.
ar: البريد الإلكتروني غير صالح.
es: Dirección de correo electrónico no válida.
fr: Adresse e-mail invalide.
ja: 無効なメールアドレスです。

# labelDonationWriteEmptyMessage
source: Please enter a message.
ar: يرجى إدخال رسالة.
es: Por favor, introduce un mensaje.
fr: Veuillez entrer un message.
ja: メッセージを入力してください。

# labelTimeYears
source: {year} years
ar: {year} سنة
es: {year} años
fr: {year} ans
ja: {year}年

# labelTimeMonths
source: {month} months
ar: {month} شهر
es: {month} meses
fr: {month} mois
ja: {month}ヶ月

# labelTimeDays
source: {day} days
ar: {day} يوم
es: {day} días
fr: {day} jours
ja: {day}日

# labelTimeHours
source: {hour} hours
ar: {hour} ساعة
es: {hour} horas
fr: {hour} heures
ja: {hour}時間

# labelTimeMinutes
source: {minute} minutes
ar: {minute} دقيقة
es: {minute} minutos
ja: {minute}分

# labelTimeSeconds
source: {second} seconds
ar: {second} ثانية
es: {second} segundos
fr: {second} secondes
ja: {second}秒

# labelTimeAgo
source: {timeStr} ago
ar: منذ {timeStr}
es: hace {timeStr}
fr: il y a {timeStr}
ja: {timeStr}前

# labelDonationDonatorName
source: Donor Name
ar: اسم المتبرع
es: Nombre del donante
fr: Nom du donateur
ja: 寄付者の名前

# labelDonationDonatorEmail
source: Email
ar: البريد الإلكتروني
es: Correo electrónico
ja: メール

# labelDonationMessage
source: Message
ar: رسالة
es: Mensaje
ja: メッセージ

# labelDonationDonatorCountry
source: Select Country
ar: اختر الدولة
es: Seleccionar país
fr: Sélectionner le pays
ja: 国を選択
